------------------------------------------------------------
-- 1. 카테고리 등록
------------------------------------------------------------
INSERT INTO store_category (name) VALUES
                                      ('카페'),
                                      ('햄버거'),
                                      ('빵'),
                                      ('분식/식사'),
                                      ('샐러드/샌드위치');

------------------------------------------------------------
-- 2. 스토어 등록  (x,y 제거)
-- location 은 건물명 그대로 유지
------------------------------------------------------------

-- ===== 카페 =====
INSERT INTO store(name, location, category_id) VALUES
                                                   ('카페-K', '본부관', 1),
                                                   ('카페미르(북악)', '북악관', 1),
                                                   ('공차', '북악관', 1),
                                                   ('스무디킹', '법학관', 1),
                                                   ('Cafe Namu(예술관)', '예술관', 1),
                                                   ('Cafe Namu(복지관)', '복지관', 1),
                                                   ('카페미르(공학관)', '공학관', 1),
                                                   ('할리스커피', '성곡도서관', 1),
                                                   ('카페(과학관)', '과학관', 1);

-- ===== 햄버거 =====
INSERT INTO store(name, location, category_id) VALUES
                                                   ('버거운버거', '복지관', 2),
                                                   ('맘스터치', '공학관', 2);

-- ===== 빵 =====
INSERT INTO store(name, location, category_id) VALUES
    ('플레이스엔', '복지관', 3);

-- ===== 분식/식사 =====
INSERT INTO store(name, location, category_id) VALUES
                                                   ('K-GIMBOB+', '북악관', 4),
                                                   ('K-BOB+', '복지관', 4);

-- ===== 샐러드/샌드위치 =====
INSERT INTO store(name, location, category_id) VALUES
                                                   ('써브웨이', '북악관', 5),
                                                   ('샐러디', '복지관', 5);


------------------------------------------------------------
-- 3. 메뉴 등록
------------------------------------------------------------

-- ===== 카페-K =====
INSERT INTO menu_item(name, price, store_id) VALUES
                                                 ('카라멜 마키야또', 6100, 1),
                                                 ('카페모카', 5700, 1),
                                                 ('바닐라 라떼', 6100, 1),
                                                 ('카페 라떼', 5200, 1),
                                                 ('카푸치노', 5200, 1),
                                                 ('아메리카노', 4500, 1),
                                                 ('디카페인 아메리카노', 4900, 1),
                                                 ('에스프레소', 4000, 1);

-- ===== 카페미르(북악) =====
INSERT INTO menu_item(name, price, store_id) VALUES
                                                 ('카라멜 마키야또', 6100, 2),
                                                 ('카페모카', 5700, 2),
                                                 ('바닐라 라떼', 6100, 2),
                                                 ('카페 라떼', 5200, 2),
                                                 ('카푸치노', 5200, 2),
                                                 ('아메리카노', 4500, 2),
                                                 ('디카페인 아메리카노', 4900, 2),
                                                 ('에스프레소', 4000, 2);

-- ===== 공차 =====
INSERT INTO menu_item(name, price, store_id) VALUES
                                                 ('블랙 밀크티', 4000, 3),
                                                 ('얼그레이 밀크티', 4000, 3),
                                                 ('타로 밀크티', 4000, 3),
                                                 ('우롱티', 3500, 3),
                                                 ('망고 요구르트', 5000, 3),
                                                 ('딸키 쿠키 스무디', 5300, 3),
                                                 ('청포도 스무디', 4800, 3),
                                                 ('제주 그린 밀크티', 4700, 3);

-- ===== 스무디킹 =====
INSERT INTO menu_item(name, price, store_id) VALUES
                                                 ('엔젤 푸드', 5500, 4),
                                                 ('스트로베리 익스트림', 5500, 4),
                                                 ('망고 페스티벌', 5500, 4),
                                                 ('레몬 트위스트 스트로베리', 5500, 4),
                                                 ('오렌지 레볼루션', 5500, 4),
                                                 ('오렌지 카밤', 4900, 4),
                                                 ('스트로베리 키스', 4900, 4),
                                                 ('그릭요거트 스트로베리 블루베리', 5500, 4);

-- ===== Cafe Namu(예술관) =====
INSERT INTO menu_item(name, price, store_id) VALUES
                                                 ('카라멜 마키야또', 6100, 5),
                                                 ('카페모카', 5700, 5),
                                                 ('바닐라 라떼', 6100, 5),
                                                 ('카페 라떼', 5200, 5),
                                                 ('카푸치노', 5200, 5),
                                                 ('아메리카노', 4500, 5),
                                                 ('디카페인 아메리카노', 4900, 5),
                                                 ('에스프레소', 4000, 5);

-- ===== Cafe Namu(복지관) =====
INSERT INTO menu_item(name, price, store_id) VALUES
                                                 ('카라멜 마키야또', 6100, 6),
                                                 ('카페모카', 5700, 6),
                                                 ('바닐라 라떼', 6100, 6),
                                                 ('카페 라떼', 5200, 6),
                                                 ('카푸치노', 5200, 6),
                                                 ('아메리카노', 4500, 6),
                                                 ('디카페인 아메리카노', 4900, 6),
                                                 ('에스프레소', 4000, 6);

-- ===== 카페미르(공학관) =====
INSERT INTO menu_item(name, price, store_id) VALUES
                                                 ('카라멜 마키야또', 6100, 7),
                                                 ('카페모카', 5700, 7),
                                                 ('바닐라 라떼', 6100, 7),
                                                 ('카페 라떼', 5200, 7),
                                                 ('카푸치노', 5200, 7),
                                                 ('아메리카노', 4500, 7),
                                                 ('디카페인 아메리카노', 4900, 7),
                                                 ('에스프레소', 4000, 7);

-- ===== 할리스커피 =====
INSERT INTO menu_item(name, price, store_id) VALUES
                                                 ('카라멜 마키야또', 6100, 8),
                                                 ('카페모카', 5700, 8),
                                                 ('바닐라 라떼', 6100, 8),
                                                 ('카페 라떼', 5200, 8),
                                                 ('카푸치노', 5200, 8),
                                                 ('아메리카노', 4500, 8),
                                                 ('디카페인 아메리카노', 4900, 8),
                                                 ('에스프레소', 4000, 8);

-- ===== 카페(과학관) =====
INSERT INTO menu_item(name, price, store_id) VALUES
                                                 ('카라멜 마키야또', 6100, 9),
                                                 ('카페모카', 5700, 9),
                                                 ('바닐라 라떼', 6100, 9),
                                                 ('카페 라떼', 5200, 9),
                                                 ('카푸치노', 5200, 9),
                                                 ('아메리카노', 4500, 9),
                                                 ('디카페인 아메리카노', 4900, 9),
                                                 ('에스프레소', 4000, 9);


------------------------------------------------------------
-- ===== 햄버거 =====
------------------------------------------------------------

-- 버거운버거
INSERT INTO menu_item(name, price, store_id) VALUES
                                                 ('버거운 치킨버거', 4600, 10),
                                                 ('갈릭마요 치킨버거', 5500, 10),
                                                 ('딥치즈 치킨버거', 5000, 10),
                                                 ('화이트어니언 치킨버거', 5300, 10),
                                                 ('데리마요 치킨버거', 5000, 10),
                                                 ('핫치킨버거', 5000, 10),
                                                 ('불닭치즈 카츠버거', 8000, 10),
                                                 ('스노우 치킨버거', 5000, 10);

-- 맘스터치
INSERT INTO menu_item(name, price, store_id) VALUES
                                                 ('인크레더블버거', 4700, 11),
                                                 ('치즈베이컨버거', 4300, 11),
                                                 ('딥치즈버거', 3800, 11),
                                                 ('화이트갈릭버거', 3900, 11),
                                                 ('휠렛버거', 3400, 11),
                                                 ('햄치즈 휠렛버거', 3700, 11),
                                                 ('싸이버거', 3200, 11),
                                                 ('불싸이버거', 3400, 11);


------------------------------------------------------------
-- ===== 빵 (플레이스엔) =====
------------------------------------------------------------
INSERT INTO menu_item(name, price, store_id) VALUES
                                                 ('연유바게트', 3000, 12),
                                                 ('감자바게트', 4000, 12),
                                                 ('보스턴 오꼬노미', 3800, 12),
                                                 ('대파 명란 베이컨', 3800, 12),
                                                 ('메론빵', 3000, 12),
                                                 ('블루베리소보로', 3000, 12),
                                                 ('뺑오 쇼콜라', 4000, 12),
                                                 ('부추 베이글', 3800, 12);


------------------------------------------------------------
-- ===== 분식/식사 =====
------------------------------------------------------------

-- K-GIMBOB+
INSERT INTO menu_item(name, price, store_id) VALUES
                                                 ('국민김밥', 3300, 13),
                                                 ('치즈김밥', 3900, 13),
                                                 ('참치김밥', 4000, 13),
                                                 ('크래미김밥', 4300, 13),
                                                 ('국민우동', 5000, 13),
                                                 ('떡볶이', 3500, 13),
                                                 ('순대', 3500, 13),
                                                 ('소떡소떡', 3000, 13);

-- K-BOB+
INSERT INTO menu_item(name, price, store_id) VALUES
                                                 ('통스팸김피덮밥', 6500, 14),
                                                 ('핵불닭덮밥', 7500, 14),
                                                 ('돈가스마요덮밥', 7500, 14),
                                                 ('우삼겹 오므라이스', 9000, 14),
                                                 ('흑돼지스팸김치찌개', 7900, 14),
                                                 ('육회비빔밥', 7700, 14),
                                                 ('우삼겹비빔밥', 7900, 14),
                                                 ('통큰소세지 오므라이스', 8000, 14);


------------------------------------------------------------
-- ===== 샐러드/샌드위치 =====
------------------------------------------------------------

-- 써브웨이
INSERT INTO menu_item(name, price, store_id) VALUES
                                                 ('에그마요', 4300, 15),
                                                 ('햄', 4700, 15),
                                                 ('치킨 데리야끼', 5400, 15),
                                                 ('터키 베이컨', 5600, 15),
                                                 ('스파이시 이탈리안', 5600, 15),
                                                 ('비엘티', 5300, 15),
                                                 ('폴드포크', 5900, 15),
                                                 ('이탈리안 비엘티', 5500, 15);

-- 샐러디
INSERT INTO menu_item(name, price, store_id) VALUES
                                                 ('시저치킨 샐러디', 5100, 16),
                                                 ('멕시칸 샐러디', 5300, 16),
                                                 ('연어 샐러디', 6500, 16),
                                                 ('탄단지 샐러디', 6200, 16),
                                                 ('차돌박이 웜볼', 6700, 16),
                                                 ('칠리베이컨 웜볼', 6200, 16),
                                                 ('차돌박이 웜랩', 5800, 16),
                                                 ('칠리베이컨 웜랩', 5300, 16);